import { Component, OnInit } from '@angular/core';
import {Timestamp} from '@angular/fire/firestore';
import { Firestore, collection, addDoc } from '@angular/fire/firestore';
import { FormBuilder, FormGroup } from '@angular/forms';
import { MatSnackBar } from '@angular/material/snack-bar';
import { Router } from '@angular/router';

@Component({
  selector: 'app-create-exercise',
  templateUrl: './create-exercise.component.html',
  styleUrls: ['./create-exercise.component.scss']
})
export class CreateExerciseComponent implements OnInit {

  formGroup: FormGroup;

  constructor(
    private firestore: Firestore,
    private snackBar: MatSnackBar,
    private fb: FormBuilder,
    private router: Router
  ) { }

  ngOnInit(): void {
    this.formGroup = this.fb.group({
      name: this.fb.control(null),
      comment: this.fb.control(null),
      videoURL: this.fb.control(null),
    });

    // this.addExercisesWithDelay(list1)
  }

  async createUser(): Promise<void> {
    try {
      const payload = { ...this.formGroup.value, id: this.generateUUID() };
      const collectionRef = collection(this.firestore, 'exercise-names');

      await addDoc(collectionRef, payload);

      this.snackBar.open('✅ Вправу успішно створено', 'Закрити', { duration: 2000 });
      this.router.navigate(['/exercises']);
    } catch (error) {
      console.error("❌ Помилка створення вправи:", error);
      this.snackBar.open('❌ Помилка створення вправи', 'Закрити', { duration: 2000 });
    }
  }

  generateUUID(): string {
    return crypto.randomUUID();
  }

  // ⬇️ Новий метод для масиву з паузою 1 секунда
  async addExercisesWithDelay(exercises: Array<{ id?: string; name: string; comment: string; videoURL: string; }>): Promise<void> {
    const collectionRef = collection(this.firestore, 'exercise-names');

    try {
      for (const exercise of exercises) {
        const payload = {
          id: exercise.id ?? this.generateUUID(),
          name: exercise.name,
          comment: exercise.comment,
          videoURL: exercise.videoURL,
          createdAt: Timestamp.now(),
        };

        await addDoc(collectionRef, payload);
        console.log('ADDED===>', payload)
        // Пауза 1 секунда перед наступною вправою
        await new Promise((resolve) => setTimeout(resolve, 1000));
      }

      this.snackBar.open(`✅ Додано ${exercises.length} вправ`, 'Закрити', { duration: 3000 });
    } catch (error) {
      console.error('❌ Помилка при масовому додаванні вправ:', error);
      this.snackBar.open('❌ Помилка при масовому додаванні вправ', 'Закрити', { duration: 3000 });
    }
  }
}

// export const list = [
//   {
//     "id": "15ec4c0a-faa2-4faf-bdf5-ad70986ea075",
//     "name": "Горизонтальна тяга по одній руці",
//     "comment": "Сядь рівно, спина пряма, прес включений. Однією рукою береш рукоять — рука витягнута, лопатка розтягнута. Спочатку зведи лопатку назад і вниз, потім тягни рукоять вздовж корпусу по горизонталі до тазу. Повільно поверни у старт, не розкручуючи корпус і не завалюючись назад.",
//     "videoURL": "https://t.me/c/2952373548/141"
//   },
//   {
//     "id": "22ea82fb-2282-41c0-963d-80f7af07abed",
//     "name": "Зворотні відтискання від лавки на тріцепс ",
//     "comment": "Зворотні відтискання від лавки на тріцепс — долоні за тілом на краю лавки, ноги вперед, таз опускається строго вниз, лікті йдуть назад, не розлітаються в сторони.",
//     "videoURL": "https://t.me/c/2952373548/140"
//   },
//   {
//     "id": "197eb5c6-9efe-41e6-8a98-fb0512fee05f",
//     "name": "Відтискання класичні від лавки ",
//     "comment": "Руки на лавці на ширині плечей, тіло в жорсткому упорі, опускання грудей до лавки як у стандартному відтисканні, прес підтягнутий.",
//     "videoURL": "https://t.me/c/2952373548/139"
//   },
//   {
//     "id": "bcbc1530-5553-4ea4-b7d1-57f20aec9a24",
//     "name": "Горизонтальна тяга ",
//     "comment": "Сидячи, спина пряма, тягнути ручку до поясу, лопатки назад і вниз, не округлювати спину, не відхиляти корпус різко назад. Уявляємо, що повинні роздавити горіх між лопатками.",
//     "videoURL": "https://t.me/c/2952373548/138"
//   },
//   {
//     "id": "7eca0224-4bdf-462f-a47f-f46999e8b0da",
//     "name": "Відтискання вузьким хватом",
//     "comment": "Відтискання вузьким хватом (лікті попри корпус) — долоні на рівні плечей, лікті щільно вздовж корпусу, акцент на тріцепс, рух вертикально вгору-вниз.",
//     "videoURL": "https://t.me/c/2952373548/137"
//   },
//   {
//     "id": "4524c469-5563-4844-9bc8-c5c1d0e5ff49",
//     "name": "Відтискання з колін широким хватом",
//     "comment": "Відтискання з колін широким хватом — техніка як у звичайних широких, але опора на коліна, тіло від колін до плечей у прямій лінії, контроль лопаток при опусканні.",
//     "videoURL": "https://t.me/c/2952373548/136"
//   },
//   {
//     "id": "67c06e91-6b1e-4bb9-8d67-d77f92a69f0d",
//     "name": "Відтискання від підлоги широким хватом",
//     "comment": "Відтискання від підлоги широким хватом — положення планки, кисті ширше плечей, тіло рівне, лопатки стабільні, опускання грудей до підлоги з контролем, без провисання тазу чи шиї.",
//     "videoURL": "https://t.me/c/2952373548/135"
//   },
//   {
//     "id": "88ed3cd0-3c5c-4d42-8117-74453f522291",
//     "name": "Тяга однією рукою стоячи на кросовері",
//     "comment": "Корпус трохи нахилений вперед, спина рівна, прес напружений. Робоча рука витягнута вперед зі старту, лопатка розтягнута. Тягни рукоять назад уздовж корпусу до лінії тазу, не розкручуючи тулуб. У верхній точці — коротка фіксація лопатки. Повернення плавне та контрольоване.",
//     "videoURL": "https://t.me/c/2952373548/134"
//   },
//   {
//     "id": "b4aa63cf-d253-4721-8331-e6ce7b3f1394",
//     "name": "Підйом штанги перед собою ",
//     "comment": "Трохи нахиляємо корпус вперед, ноги на ширині таза. Хват трохи ширший плечей. Корпус стабільний, прес напружений. Підіймай штангу перед собою до рівня плечей, лікті злегка зігнуті, рух контрольований. Не розгойдуй корпус і не закидай вагу інерцією. Повільно опусти вниз, зберігаючи напругу в дельті весь рух.",
//     "videoURL": "https://t.me/c/2952373548/133"
//   },
//   {
//     "id": "be8ff12e-b948-4cd2-8c7c-47f1afd68a04",
//     "name": "Махи в сторони сидячи (фіксовані лопатки)",
//     "comment": "Сидячи рівно, лопатки зведені та зафіксовані. Піднімай гантелі в сторони до рівня плечей, лікоть трохи вище зап’ястя. Корпус не розгойдується, амплітуда середня, підйом і опускання контрольовані.",
//     "videoURL": "https://t.me/c/2952373548/132"
//   },
//   {
//     "id": "59681f5b-0c17-456d-88b1-8e77e91faea5",
//     "name": "Підйом гантелі перед собою почергово",
//     "comment": "Спина притиснута до спинки лавки, лопатки фіксовані. Піднімай гантель перед собою однією рукою до рівня плеча, корпус не рухається. Лікті трохи зігнуті, підйом повільний, без ривків. Опускай плавно, одразу працює інша рука.",
//     "videoURL": "https://t.me/c/2952373548/131"
//   },
//   {
//     "id": "f30c38e6-4efc-410f-a187-6f7590e81d92",
//     "name": "Скручування на похилій лавці",
//     "comment": "Спина лягає на лавку з фіксацією таза, руки біля голови або на грудях. На видиху скручуй корпус вгору, піднімаючи лопатки, без ривка шиєю і без прогину в попереку. Не сідай повністю — амплітуда коротка, фокус тільки на верхньому пресі. Опускання — повільне та під контролем.",
//     "videoURL": "https://t.me/c/2952373548/129"
//   },
//   {
//     "id": "15388a54-e879-4ae0-837e-3fe58cff9ed6",
//     "name": "Випад у сторону",
//     "comment": "Розстав ноги ширше таза. Зроби крок у сторону, опускаючись у випад на одну ногу, друга залишається прямою. Таз і корпус відводяться назад, коліно опорної ноги не виходить за носок. Повернення у старт за рахунок поштовху з п’яти опорної ноги.",
//     "videoURL": "https://t.me/c/2952373548/128"
//   },
//   {
//     "id": "6ba1525f-de99-495a-bc35-4b468caa64a6",
//     "name": "Випад назад зі степу (підвищення)",
//     "comment": "З передньою ногою на степі зроби крок назад іншою ногою. Опускайся вниз, поки переднє коліно не стане приблизно під 90°, п’ята передньої ноги залишається притиснутою. Корпус злегка нахилений уперед, прес напружений, рух повільний і контрольований. Повернення — поштовхом з передньої ноги.",
//     "videoURL": "https://t.me/c/2952373548/127"
//   },
//   {
//     "id": "3a8e5d0a-3cb2-4455-a3ca-dc4f5642b54b",
//     "name": "Скручування сидячи з м'ячем",
//     "comment": "Сісти, ноги зігнуті, п’яти на підлозі, корпус злегка під нахилом. М'яч притиснутий до грудей або тримається попереду. Скручування виконується скороченням преса, а не за рахунок ривка шиєю. Піднімай корпус до легкого скорочення верхнього преса, не завалюй поперек.",
//     "videoURL": "https://t.me/c/2952373548/126"
//   },
//   {
//     "id": "f484149b-f07e-412b-a299-c9e65b761d5f",
//     "name": "Планка на ліктях ",
//     "comment": "Упор на передпліччя та носки, тіло в пряму лінію від голови до п’ят, прес і сідниці напружені, таз не провисає і не задирається, дихання рівне.",
//     "videoURL": "https://t.me/c/2952373548/125"
//   },
//   {
//     "id": "61d754ac-50c8-4651-9399-ce9e2b7a4d8e",
//     "name": "Планка на прямих руках",
//     "comment": "Упор як у відтисканні, кисті під плечима, руки прямі, корпус у натягнутій лінії, прес і сідниці включені, лопатки стабільні, не провалюються і не «вилазять» вгору.",
//     "videoURL": "https://t.me/c/2952373548/124"
//   },
//   {
//     "id": "ae24b1e5-b723-4a7e-a9fc-7df8c8293b6a",
//     "name": "Парашутист",
//     "comment": "Лежачи на животі, руки вперед або трохи в сторони, одночасно піднімаєш груди, руки й ноги вгору, стискаючи лопатки та напружуючи сідниці, рух короткий і контрольований без прогину в попереку.",
//     "videoURL": "https://t.me/c/2952373548/123"
//   },
//   {
//     "id": "dd0f5d87-3f53-42a5-be20-5f05f1b32b7f",
//     "name": "Скручування з торканням носків ",
//     "comment": "Лежачи на спині, ноги підняті під кутом приблизно 90°, коліна можуть бути злегка зігнуті. На видиху підкручуй таз та скручуй корпус одночасно, намагаючись дістати руками до носків або гомілок. Рух іде не за рахунок шиї, а за рахунок таза і скорочення преса. Поперек коротко відривається від підлоги. Опускайся плавно, без повного розслаблення — прес постійно в напрузі.",
//     "videoURL": "https://t.me/c/2952373548/122"
//   },
//   {
//     "id": "91402bf7-cdf7-4604-9e32-06b9ed10886b",
//     "name": "Скручування лежачи на спині ",
//     "comment": "Лежачи на підлозі, ноги зігнуті, п’яти на підлозі. Руки біля голови або на грудях. Скручування виконуються підняттям лопаток від підлоги, поперек не відривається. Важливо відчути скорочення преса, а не тягнути себе шиєю.",
//     "videoURL": "https://t.me/c/2952373548/121"
//   },
//   {
//     "id": "c8a8580e-aa56-486f-b5d3-b2815ed9b34d",
//     "name": "Проходка випадом по залу",
//     "comment": "Проходка випадом по залу — крок уперед на п’яту, корпус злегка нахилений вперед, переднє коліно під 90°, заднє пружне, поштовх із передньої ноги й плавний перехід на іншу.",
//     "videoURL": "https://t.me/c/2952373548/120"
//   },
//   {
//     "id": "835cd199-b4a9-422c-848c-cd4fbd31b7fb",
//     "name": "Фронтальні присідання з гантелею ",
//     "comment": "Гантеля вертикально перед грудьми, п’яти на платформі, корпус прямий, коліна виводяться назовні, присід до паралелі або глибше ( ніби на п'яти сідаємо) з контролем.",
//     "videoURL": "https://t.me/c/2952373548/119"
//   },
//   {
//     "id": "e8189f7d-bc18-458e-8403-442229b97833",
//     "name": "Тяга верхнього блоку маленькою ручкою ",
//     "comment": "Беремось за ручку вузьким хватом, рух починається зі зведення лопаток. Тягнемо ручку до грудей, корпус стабільний без надмірного прогину. ",
//     "videoURL": "https://t.me/c/2952373548/118"
//   }
// ]


